hockeypuck-delete.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-11-28 Mon 13:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>delete keys from hockeypuck</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<nav>
<a href="index.html">home</a> /
<a href="about.html">about</a> /
<a href="sitemap.html">sitemap</a> /
</nav>
</head>
<body>
<div id="content" class="content">
<h1 class="title">delete keys from hockeypuck</h1>
<p>
adapted from adulau's github gist
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0000000">1. deleting a key from the database</a>
<ul>
<li><a href="#org0000001">1.1. get hash</a></li>
<li><a href="#org0000002">1.2. connect to postgres</a></li>
<li><a href="#org0000003">1.3. get the <code>rfingerprint</code> value</a></li>
<li><a href="#org0000004">1.4. delete subkeys</a></li>
<li><a href="#org0000005">1.5. delete main key</a></li>
</ul>
</li>
<li><a href="#org0000006">2. <span class="todo TODO">TODO</span> blacklisting a key</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0000000" class="outline-2">
<h2 id="org0000000"><span class="section-number-2">1.</span> deleting a key from the database</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org0000001" class="outline-3">
<h3 id="org0000001"><span class="section-number-3">1.1.</span> get hash</h3>
<div class="outline-text-3" id="text-1-1">
<p>
on the web interface, search for the key. the <code>Hash=</code> value in the
search result will be the md5 hash
</p>
</div>
</div>

<div id="outline-container-org0000002" class="outline-3">
<h3 id="org0000002"><span class="section-number-3">1.2.</span> connect to postgres</h3>
<div class="outline-text-3" id="text-1-2">
<p>
connnect using the <code>psql</code> command. if using the nixos module, you will
have to switch to the <code>hockeypuck</code> user.
</p>

<pre class="example" id="org0000007">
sudo -u hockeypuck psql
</pre>
</div>
</div>

<div id="outline-container-org0000003" class="outline-3">
<h3 id="org0000003"><span class="section-number-3">1.3.</span> get the <code>rfingerprint</code> value</h3>
<div class="outline-text-3" id="text-1-3">
<pre class="example" id="org0000007">
select rfingerprint from keys where md5 in ('YOURMD5');
</pre>

<p>
replacing <code>YOURMD5</code> with the hash you found earlier.
</p>
</div>
</div>

<div id="outline-container-org0000004" class="outline-3">
<h3 id="org0000004"><span class="section-number-3">1.4.</span> delete subkeys</h3>
<div class="outline-text-3" id="text-1-4">
<pre class="example" id="org0000007">
delete from subkeys where rfingerprint in ('YOURRFINGERPRINT');
</pre>

<p>
replacing <code>YOURRFINGERPRINT</code> with the rfingerprint gotten earlier.
</p>
</div>
</div>

<div id="outline-container-org0000005" class="outline-3">
<h3 id="org0000005"><span class="section-number-3">1.5.</span> delete main key</h3>
<div class="outline-text-3" id="text-1-5">
<pre class="example" id="org0000007">
delete from keys where rfingerprint in ('YOURRFINGERPRINT');
</pre>

<p>
again, replacing <code>YOURRFINGERPRINT</code> with the rfingerprint gotten
earlier.
</p>
</div>
</div>
</div>

<div id="outline-container-org0000006" class="outline-2">
<h2 id="org0000006"><span class="section-number-2">2.</span> <span class="todo TODO">TODO</span> blacklisting a key</h2>
</div>
</div>
</body>
</html>
